/* Необхідно написати програму, яка виконує складання чисел від N до M (N та M – задаються користувачем), а також програма має вміти пропускати парні числа. 
Нижче приведено алгоритм, що потрібно зробити. 
(!) При виводі суми можна використовувати функції console.log або document.writeln 

Отримайте у користувача число(N) від якого ми будемо складати. 
Отримати число можна за допомогою prompt.  Пам'ятайте, ЧИСЛО, не РЯДОК! 
Перевірте, чи є передане значення N ЦІЛИМ числом. 
(Підказка: якщо при конвертації в ціле число ми отримали NaN – це число нам не підходить) 

Отримайте у користувача число(M) до якого ми будемо складати (включно). 
Отримати число можна за допомогою prompt.  Пам'ятайте, ЧИСЛО, не РЯДОК! 
Перевірте, чи є передане значення M ЦІЛИМ числом. 
(Підказка: якщо при конвертації в ціле число ми отримали NaN – це число нам не підходит) */

/*Отримайте у користувача булевий параметр(true/false), який підкаже нам чи потрібно пропускати парні числа. TRUE – потрібно, FALSE – не потрібно. Використовуйте функцію confirm

Напишіть цикл, який буде складати числа від раніше отриманих N та M 
В циклі додайте перевірку – чи потрібно пропускати при складанні парні числа. 
(Використовуйте для цього if/else). 
Якщо парні числа потрібно пропускати не додавайте їх до суми.Виведіть результат */

let numN = NaN;
do {
  numN = Number(prompt("Ввести число N"));
} while (!Number.isInteger(numN));
console.log("число N =", numN);

let numM = NaN;
do {
  numM = Number(prompt("Ввести число M"));
} while (!Number.isInteger(numM));
console.log("число M =", numM);

let isEven = confirm(
  "Потрібно пропускати парні числа? Потрібно чи Не потрібно"
);
console.log("TRUE – потрібно, FALSE – не потрібно", isEven);

let sum = 0;

for (let i = numN; i <= numM; i++) {
  if (isEven == true && i % 2 === 0) {
    continue;
  }
  sum += i;
}
console.log("Сума чисел", sum);

//test-2
